---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ATFContainedUnsupportedGeometricDataCurvesAllowed
source: html/e359bfcb-90ae-3efe-8c6e-f673e6729815.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ATFContainedUnsupportedGeometricDataCurvesAllowed Property

The original model contains unsupported geometric data.

## Syntax (C#)
```csharp
public static FailureDefinitionId ATFContainedUnsupportedGeometricDataCurvesAllowed { get; }
```